modules/comercial/models/TabContratoQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM "comercial"."tab_contrato" WHERE ativo is true and cod_cliente_fk = 2433