modules/comercial/models/TabTipoContratoQuery.php

SELECT * FROM "comercial"."tab_tipo_contrato" WHERE ativo is true and (tipo_produto_fk in (524, 523)) and cod_contrato_fk = 14014
---
    public function one($db = null)
    {
        return parent::one($db);