modules/posoutorga/models/TabSiciQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM "pos_outorga"."tab_sici"