modules/posoutorga/views/sici/index.php

SELECT COUNT(*) FROM "pos_outorga"."tab_sici" WHERE pos_outorga.tab_sici.dt_exclusao IS NULL
---
    <div class="box-body with-border">
        <?php // echo $this->render('_search', ['model' => $searchModel]);    ?>

        <?=
        GridView::widget([
            'dataProvider' => $dataProvider,
            'filterModel' => $searchModel,
            'columns' => [
                'cnpj',
                'razao_social',
                'fistel',
                'mes_ano_referencia',
                'usuario_inclusao_sici',

              [
					'attribute' => 'dsc_situacao',
					'content' => function($data) {
                                                $cor = ($data->situacao_fk == \app\models\TabAtributosValoresSearch::getAtributoValorAtributo('situacao-sici', 'C')) ? 'text-green' : 'text-yellow';
						return  "<div class='{$cor}'>".$data->dsc_situacao.'</div>';
					},

					'filter' => app\models\TabAtributosValoresSearch::getAtributoValor(\app\models\TabAtributosSearch::findOne(['sgl_chave'=>'situacao-sici'])->cod_atributos),
				],
                ['class' => 'projeto\grid\ActionColumn',
                    'headerOptions' => ['style' => 'width:60px;'],
                    'template' => '{update} {delete} {gerar}',