modules/posoutorga/controllers/SiciController.php

UPDATE "pos_outorga"."tab_sici" SET "valor_consolidado"=NULL, "qtd_funcionarios_fichados"=NULL, "qtd_funcionarios_terceirizados"=NULL, "num_central_atendimento"=NULL, "total_fibra_prestadora"=NULL, "total_fibra_terceiros"=NULL, "total_crescimento_prestadora"=NULL, "total_crescimento_terceiros"=NULL, "total_fibra_implantada_prestadora"=NULL, "total_fibra_implantada_terceiros"=NULL, "total_fibra_crescimento_prop_prestadora"=NULL, "total_fibra_crescimento_prop_terceiros"=NULL, "aplicacao_equipamento"=NULL, "total_marketing_propaganda"=NULL, "aplicacao_software"=NULL, "total_pesquisa_desenvolvimento"=NULL, "aplicacao_servico"=NULL, "aplicacao_callcenter"=NULL, "faturamento_de"=NULL, "faturamento_industrial"=NULL, "faturamento_adicionado"=NULL, "dt_inclusao"='05/06/2017', "tipo_sici_fk"=514, "tipo_entrada_fk"=518, "cod_protocolo"='324234' WHERE "cod_sici"=306
---
                $sici->attributes = $post['TabSiciSearch'];


                if (!$sici->save()) {

UPDATE "pos_outorga"."tab_planos" SET "valor_512k_2m"=NULL, "valor_12m_34m"=NULL, "valor_34m"=NULL, "valor_512_check"=TRUE, "valor_512k_2m_check"=TRUE, "valor_2m_12m_check"=TRUE, "valor_12m_34m_check"=TRUE, "valor_34m_check"=TRUE WHERE "cod_plano"=2488
---
                if (!$planof->verificarChecks($id))
                    $check[] = false;

                $planof->save();

UPDATE "pos_outorga"."tab_planos" SET "valor_512"=NULL, "valor_512k_2m"=NULL, "valor_2m_12m"=NULL, "valor_34m"=NULL, "valor_512_check"=TRUE, "valor_512k_2m_check"=TRUE, "valor_2m_12m_check"=TRUE, "valor_12m_34m_check"=TRUE, "valor_34m_check"=TRUE WHERE "cod_plano"=2489
---
                if (!$planoj->verificarChecks($id))
                    $check[] = false;

                $planoj->save();

DELETE FROM "pos_outorga"."tab_planos" WHERE ("cod_chave"=977) AND ("tipo_tabela_fk"='pos_outorga.tab_empresa_municipio')
DELETE FROM "pos_outorga"."tab_empresa_municipio" WHERE "cod_empresa_municipio"=977
---
                    if ($empresasDados) {
                        foreach ($empresasDados as $key => $value) {

                            \app\modules\posoutorga\models\TabPlanosSearch::deleteAll(['cod_chave' => $value->cod_empresa_municipio, 'tipo_tabela_fk' => $value->tableName()]);
                            $value->delete();

INSERT INTO "pos_outorga"."tab_planos" ("valor_512", "valor_512k_2m", "valor_2m_12m", "valor_12m_34m", "valor_34m", "tipo_plano_fk", "obs", "valor_512_check", "valor_512k_2m_check", "valor_2m_12m_check", "valor_12m_34m_check", "valor_34m_check", "tipo_tabela_fk", "cod_chave") VALUES ('333', '0', '0', '0', '0', 468, NULL, NULL, NULL, NULL, NULL, NULL, 'pos_outorga.tab_empresa_municipio', 978) RETURNING "cod_plano"
---
                        $planof_municipio->attributes = $municipio[1];
                        $planof_municipio->tipo_tabela_fk = $empresa->tableName();
                        $planof_municipio->cod_chave = $empresa->cod_empresa_municipio;
                        $planof_municipio->save();

INSERT INTO "pos_outorga"."tab_planos" ("valor_512", "valor_512k_2m", "valor_2m_12m", "valor_12m_34m", "valor_34m", "tipo_plano_fk", "obs", "valor_512_check", "valor_512k_2m_check", "valor_2m_12m_check", "valor_12m_34m_check", "valor_34m_check", "tipo_tabela_fk", "cod_chave") VALUES ('0', '0', '0', '333', '0', 469, NULL, NULL, NULL, NULL, NULL, NULL, 'pos_outorga.tab_empresa_municipio', 978) RETURNING "cod_plano"
---
                        $planoj_municipio->attributes = $municipio[2];
                        $planoj_municipio->tipo_tabela_fk = $empresa->tableName();
                        $planoj_municipio->cod_chave = $empresa->cod_empresa_municipio;
                        $planoj_municipio->save();