modules/posoutorga/controllers/SiciController.php

INSERT INTO "pos_outorga"."tab_planos" ("valor_512", "valor_512k_2m", "valor_2m_12m", "valor_12m_34m", "valor_34m", "tipo_plano_fk", "obs", "tipo_tabela_fk", "cod_chave") VALUES (NULL, NULL, NULL, NULL, NULL, 469, NULL, 'pos_outorga.tab_empresa_municipio', 105) RETURNING "cod_plano"
---
                $planof->tipo_tabela_fk = $sici->tableName();
                $planof->tipo_plano_fk = \app\models\TabAtributosValoresSearch::getAtributoValorAtributo('tipo-pessoa-plano', 'F');
                $planof->cod_chave = $sici->cod_sici;
                $planof->save();

DELETE FROM "pos_outorga"."tab_empresa_municipio" WHERE "cod_empresa_municipio"=564
DELETE FROM "pos_outorga"."tab_planos" WHERE ("cod_chave"=564) AND ("tipo_tabela_fk"='pos_outorga.tab_empresa_municipio')
---
                        foreach ($empresasDados as $key => $value) {

                            \app\modules\posoutorga\models\TabPlanosSearch::deleteAll(['cod_chave' => $value->cod_empresa_municipio, 'tipo_tabela_fk' => $value->tableName()]);
                            $value->delete();

INSERT INTO "pos_outorga"."tab_planos" ("valor_512", "valor_512k_2m", "valor_2m_12m", "valor_12m_34m", "valor_34m", "tipo_plano_fk", "obs", "tipo_tabela_fk", "cod_chave") VALUES ('0', '64', '92', '0', '0', 468, NULL, 'pos_outorga.tab_empresa_municipio', 568) RETURNING "cod_plano"
---
                        $planoj_municipio->attributes = $municipio[2];
                        $planoj_municipio->tipo_tabela_fk = $empresa->tableName();
                        $planoj_municipio->cod_chave = $empresa->cod_empresa_municipio;
                        $planoj_municipio->save();

INSERT INTO "pos_outorga"."tab_planos" ("tipo_plano_fk", "valor_512", "valor_512k_2m", "valor_2m_12m", "valor_12m_34m", "valor_34m", "obs", "tipo_tabela_fk", "cod_chave") VALUES (468, '42', '60', '120', NULL, NULL, '', 'pos_outorga.tab_sici', NULL) RETURNING "cod_plano"
---
                    $planof->attributes = Yii::$app->request->post()['TabPlanosF'];
                    $planof->tipo_tabela_fk = $sici->tableName();
                    $planof->cod_chave = $sici->cod_sici;
                    $planof->save();

INSERT INTO "pos_outorga"."tab_planos" ("tipo_plano_fk", "valor_512", "valor_512k_2m", "valor_2m_12m", "valor_12m_34m", "valor_34m", "obs", "tipo_tabela_fk", "cod_chave") VALUES (469, NULL, NULL, NULL, NULL, NULL, '', 'pos_outorga.tab_sici', NULL) RETURNING "cod_plano"
---
                    $planoj->attributes = Yii::$app->request->post()['TabPlanosJ'];
                    $planoj->tipo_tabela_fk = $sici->tableName();
                    $planoj->cod_chave = $sici->cod_sici;
                    $planoj->save();

INSERT INTO "pos_outorga"."tab_planos" ("valor_512", "valor_512k_2m", "valor_2m_12m", "valor_12m_34m", "valor_34m", "tipo_plano_fk", "obs", "tipo_tabela_fk", "cod_chave") VALUES ('0', '87', '40', '0', '0', 468, NULL, 'pos_outorga.tab_empresa_municipio', 461) RETURNING "cod_plano"
---
                            $planof_municipio->attributes = $municipio[1];
                            $planof_municipio->tipo_tabela_fk = $empresa->tableName();
                            $planof_municipio->cod_chave = $empresa->cod_empresa_municipio;
                            $planof_municipio->save();

INSERT INTO "pos_outorga"."tab_planos" ("valor_512", "valor_512k_2m", "valor_2m_12m", "valor_12m_34m", "valor_34m", "tipo_plano_fk", "obs", "tipo_tabela_fk", "cod_chave") VALUES ('0', '0', '0', '0', '0', 469, NULL, 'pos_outorga.tab_empresa_municipio', 461) RETURNING "cod_plano"
---
                            $planoj_municipio->attributes = $municipio[2];
                            $planoj_municipio->tipo_tabela_fk = $empresa->tableName();
                            $planoj_municipio->cod_chave = $empresa->cod_empresa_municipio;
                            $planoj_municipio->save();