models/TabClienteQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM "tab_cliente" WHERE cnpj = '12356161000100'  OR replace(replace(replace(cnpj, '.', ''), '-', ''), '/', '')='12356161000100'