models/TabParametrosQuery.php

SELECT * FROM "tab_parametros"
---
    public function all($db = null)
    {
        return parent::all($db);